# Structural Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Structural Property
GroupTypeId Class See Also
---
Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Structural { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Structural As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Structural {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace